pub fn to_mikaka(alphabet:&str) -> &str {
    match alphabet {
        "1" => "ぬ",
        "2" => "ふ",
        "3" => "あ",
        "4" => "う",
        "5" => "え",
        "6" => "お",
        "7" => "や",
        "8" => "ゆ",
        "9" => "よ",
        "0" => "わ",
        "-" => "ほ",
        "^" => "へ",
        "\\"=> "ー",
        "q" => "た",
        "w" => "て",
        "e" => "い",
        "r" => "す",
        "t" => "か",
        "y" => "ん",
        "u" => "な",
        "i" => "に",
        "o" => "ら",
        "p" => "せ",
        "a" => "ち",
        "s" => "と",
        "d" => "し",
        "f" => "は",
        "g" => "き",
        "h" => "く",
        "j" => "ま",
        "k" => "の",
        "l" => "り",
        ";" => "れ",
        ":" => "け",
        "]" => "む",
        "z" => "つ",
        "x" => "さ",
        "c" => "そ",
        "v" => "ひ",
        "b" => "こ",
        "n" => "み",
        "m" => "も",
        "," => "ね",
        "." => "る",
        "/" => "め",
        "_" => "ろ",
        " " => "　",
        _   => alphabet
    }
}

pub fn from_mikaka(hiragana:&str) -> &str {
    match hiragana {
        "ぬ" => "1",
        "ふ" => "2",
        "あ" => "3",
        "う" => "4",
        "え" => "5",
        "お" => "6",
        "や" => "7",
        "ゆ" => "8",
        "よ" => "9",
        "わ" => "0",
        "ほ" => "-",
        "へ" => "^",
        "ー" => "\\",
        "た" => "q",
        "て" => "w",
        "い" => "e",
        "す" => "r",
        "か" => "t",
        "ん" => "y",
        "な" => "u",
        "に" => "i",
        "ら" => "o",
        "せ" => "p",
        "ち" => "a",
        "と" => "s",
        "し" => "d",
        "は" => "f",
        "き" => "g",
        "く" => "h",
        "ま" => "j",
        "の" => "k",
        "り" => "l",
        "れ" => ";",
        "け" => ":",
        "む" => "]",
        "つ" => "z",
        "さ" => "x",
        "そ" => "c",
        "ひ" => "v",
        "こ" => "b",
        "み" => "n",
        "も" => "m",
        "ね" => ",",
        "る" => ".",
        "め" => "/",
        "ろ" => "_",
        "　" => " ",
        _    => hiragana
    }
}

pub fn test(){
    let test_hiragana = "ぬふあうえおやゆよわほへーたていすかんなにらせちとしはきくまのりれけむつさそひこみもねるめろ　";
    println!("{}",test_hiragana);
    for c in test_hiragana.chars() {
        print!("{}",to_mikaka(from_mikaka(c.to_string().as_str())));
    }
    print!("\n");

    let test_alphabet = "123456789990-^\\qwertyuiopasdfghjkl;:]zxcvbnm,./_ ";
    println!("{}",test_alphabet);
    for c in test_alphabet.chars() {
        print!("{}",from_mikaka(to_mikaka(c.to_string().as_str())));
    }
    print!("\n");
}

